tap "adoptopenjdk/openjdk"
tap "colindean/fonts-nonfree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "rigellute/tap"
brew "ack"
brew "archey"
brew "aria2"
brew "bat"
brew "bettercap"
brew "python"
brew "cdrtools"
brew "gnutls"
brew "ffmpeg"
brew "cmus"
brew "composer"
brew "coreutils"
brew "ddrescue"
brew "dnscrypt-proxy", restart_service: true
brew "dnsmasq"
brew "dust"
brew "dvd+rw-tools"
brew "dvdauthor"
brew "dvdbackup"
brew "exa"
brew "fd"
brew "fish"
brew "fortune"
brew "git"
brew "git-extras"
brew "gnu-units"
brew "go"
brew "grc"
brew "grep"
brew "guetzli"
brew "hashcat"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hub"
brew "hyperfine"
brew "ipcalc"
brew "iproute2mac"
brew "jq"
brew "knot-resolver"
brew "ldns"
brew "make"
brew "mariadb"
brew "mas"
brew "mono"
brew "mtr"
brew "nano"
brew "ncdu"
brew "nginx"
brew "ngrep"
brew "nikto"
brew "nmap"
brew "php"
brew "php-cs-fixer"
brew "prettyping"
brew "procs"
brew "proselint"
brew "pwgen"
brew "ripgrep"
brew "ruby"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "spoof-mac"
brew "starship"
brew "streamlink"
brew "terminal-notifier"
brew "thefuck"
brew "tldr"
brew "tokei"
brew "topgrade"
brew "tree"
brew "unar"
brew "watchexec"
brew "wget"
brew "wp-cli"
brew "yadm"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-completions"
cask "aerial"
cask "alacritty"
cask "docker"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "gpg-suite"
cask "lunchy"
cask "makemkv"
cask "mounty"
cask "podman"
cask "signal"
cask "syncthing"
cask "transmission"
cask "visual-studio-code"
cask "adoptopenjdk/openjdk/adoptopenjdk8-jre"
cask "colindean/fonts-nonfree/font-microsoft-office"
mas "1Blocker", id: 1107421413
mas "Color Note", id: 1099028591
mas "EtreCheck", id: 1423715984
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Gemini 2", id: 1090488118
mas "iMovie", id: 408981434
mas "Microsoft Remote Desktop", id: 1295203466
mas "Monit", id: 1014850245
mas "Parcel", id: 639968404
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 1289583905
mas "RAW Power", id: 1157116444
mas "Textual IRC Client", id: 1262957439
mas "The Unarchiver", id: 425424353
mas "Toast DVD", id: 829469267
mas "WiFi Explorer", id: 494803304
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
